brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed'
# Install a modern version of Bash.
brew 'bash'
brew 'bash-completion2'
brew 'zsh'

# Install GnuPG to enable PGP-signing commits.
brew 'gnupg'

# Install more recent versions of some macOS tools.
brew 'neovim'
brew 'grep'
brew 'openssh'
brew 'screen'
brew 'php'
brew 'gmp'

# Install font tools.
tap 'bramstein/webfonttools'
brew 'sfnt2woff'
brew 'woff2'

# fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'

# Install other useful binaries.
brew 'ack'
brew 'bat'
brew 'ast-grep'
brew 'ripgrep'
brew 'fd'
brew 'git'
brew 'git-lfs'
brew 'gs'
brew 'go'
brew 'imagemagick'
brew 'lua'
brew 'lynx'
brew 'node'
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'rename'
brew 'rlwrap'
brew 'ssh-copy-id'
brew 'starship'
brew 'tree'
brew 'vbindiff'
brew 'wget'
brew 'zopfli'

# applications
cask 'visual-studio-code' unless system 'which code'
